[
    {
        "company": "Mukesh & Associates",
        "job_title": "Not available",
        "eligibility_criteria": "Not available",
        "job_description": "Not available",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Team Leader (1)",
        "eligibility_criteria": "Graduate in Civil Engineering.",
        "job_description": "Having 20 year experience in designing, construction management, and supervision of large integrated water supply and Drainage Projects.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Deputy Team Leader (DTL) cum Water Supply Specialist (2)",
        "eligibility_criteria": "Graduate in Civil Engineering, preferably with a Master’s degree in Public Health Engineering or Project Management or equivalent.",
        "job_description": "Having 15 year experience in designing, construction management, supervision of large integrated water supply projects, such as pipe lines, water treatment plants, waste water treatment plants, river intake structures, pumping stations, improved drainage network etc.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Water Supply and Network (WSN) Specialist (3)",
        "eligibility_criteria": "Post Graduate in Water supply / Public health engineering or equivalent.",
        "job_description": "Having 15 year experience in designing, construction management, supervision of large integrated water supply projects, pipe lines, water treatment plants, river intake structures, pumping stations etc.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Electrical Expert (4)",
        "eligibility_criteria": "Graduate in Electrical Engineering.",
        "job_description": "Having at least 15 years’ experience in designing, construction management, supervision and quality assurance of electrical equipment and systems in large water supply and, water treatment plants, river intake structures, pumping stations etc. shall be preferred.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Mechanical Expert (5)",
        "eligibility_criteria": "Graduate in Mechanical Engineering.",
        "job_description": "Having at least 15 years’ experience in designing, construction management, supervision and quality assurance of mechanical equipment and systems in large water supply and, water treatment plants, river intake structures, pumping stations, sewerage treatment plants etc. shall be preferred.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Structural Engineering Specialist (6)",
        "eligibility_criteria": "Post Graduate in Structural Engineering or equivalent.",
        "job_description": "Having 15 years’ experience in designing, construction management, supervision of large water supply, sewerage, road, building and bridge projects based on latest technologies and design concepts.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Water Treatment / Process (WTP) Specialist (7)",
        "eligibility_criteria": "Graduate in Civil Engineering.",
        "job_description": "Having 10 years’ experience in designing, construction management, supervision of large water treatment /processing plants and systems based on latest technologies.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Quantity Surveyor (8)",
        "eligibility_criteria": "Graduate in Civil Engineering.",
        "job_description": "Having minimum 15 year experience / Diploma in civil engineering with 20 year experience in estimation, preparation of BOQ and normal procurement procedures.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Construction Management (CM) Specialist (9)",
        "eligibility_criteria": "Graduate in Civil Engineering.",
        "job_description": "Having minimum 15 years’ experience in construction management, supervision and quality control of projects related to water supply, sewerage, drainage, road and building works.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Procurement and Contract Specialist (10)",
        "eligibility_criteria": "Graduate in Civil Engineering.",
        "job_description": "Having minimum 10 year experience in contract and normal procurement procedures.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Survey Specialist (11)",
        "eligibility_criteria": "Graduate in Civil Engineering.",
        "job_description": "Having 10 year or diploma holder with 15 year experience in survey works related to water supply, sewerage, road, drainage projects under urban areas; by using latest technologies and equipment like Total Station, GPS etc.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Environmental, Health & Safety Specialist (EHS) (12)",
        "eligibility_criteria": "Post Graduate in Planning or Environment or Ecology.",
        "job_description": "Having minimum 10 years’ experience in designing environment related safeguards for donor aided projects, preferably with NDB and in oversight of their implementation / compliance.\nConversant with relevant national and state environmental laws, and NDB procedures.\nAlso, experience in works related to water supply, sewerage, drainage projects etc. under urban areas with diploma on EHS management.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Social Safeguard Specialist & Gender Specialist (13)",
        "eligibility_criteria": "Post Graduate in Social Science.",
        "job_description": "Having at least 10 years’ experience in designing of resettlement plans and framework and experience in implementing resettlement plans as part of donor supported projects, preferably with the NDB.\nConversant with laws relating to land acquisition, state procedures in implementation of resettlement packages and NDB procedures.\nAlso experience in designing and implementing public relations and community awareness project.\nExperience of preparing, implementing and monitoring implementation of Gender Action Plan.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Institutional and Training Specialist (I&Ts) (14)",
        "eligibility_criteria": "Post Graduate Masters in Planning / Institutional Management / Public Administration / Urban Management.",
        "job_description": "Having 15 years’ experience of managing institutional matters and setting suitable institutional systems in urban sector.\nExperience of institutional training for organization strengthening shall be added advantage.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Information & Communication Technology (ICT) Specialist (15)",
        "eligibility_criteria": "Graduate in MCA / Computer / Software Engineer.",
        "job_description": "Having at least 10 years’ experience of designing and implementing a suitable ICT including Project Performance Monitoring System (PPMS) for projects related to urban sector.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Project Financial Specialist (PFS) (16)",
        "eligibility_criteria": "Graduate in Financial Analyst / Chartered Accountant.",
        "job_description": "Having 15 years’ experience of designing and establishing suitable financing management system.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Non-Revenue Water (NRW) Specialist (17)",
        "eligibility_criteria": "Graduate in Civil Engineering.",
        "job_description": "Having 10 years’ experience in construction and maintenance of water supply network and additional 7 years’ experience for Non Revenue water (NRW) management with the water utility operators, preferably in the developing counties, with sufficient knowledge and experience of NRW management and water loss management and preparing and negotiating the performance-based contract for NRW management. And identification and redressal of leaks in complex water supply network through latest technology and experience in district metered zone management.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "Geographical Information System (GIS) Specialist (18)",
        "eligibility_criteria": "Graduate in Engineering / Science with Post Graduate Degree Diploma in Remote Sensing / GIS Application.",
        "job_description": "Having 10 years of post-qualification relevant experience in GIS application in at least two cities / towns.",
        "location": "Assam"
    },
    {
        "company": "Mukesh & Associates",
        "job_title": "SCADA Specialist (19)",
        "eligibility_criteria": "Bachelor / Master’s degree in Computer Information System / Computer Science or related field .",
        "job_description": "Minimum of 10 years related working experience\nRelated experience includes industrial electrical work, instrumentation and controls related work, experience with radio and communications systems, information technology, and direct experience with automated control systems.",
        "location": "Assam"
    }
]